---
kind: method
id: M:Autodesk.Revit.DB.IFC.IFCData.CreateDoubleOfType(System.Double,System.String)
source: html/c73f6982-ad44-27b9-8930-cdb9a984cdd1.htm
---
# Autodesk.Revit.DB.IFC.IFCData.CreateDoubleOfType Method

Creates a double data object of the specified type.

## Syntax (C#)
```csharp
public static IFCData CreateDoubleOfType(
	double value,
	string typeName
)
```

## Parameters
- **value** (`System.Double`) - The double value.
- **typeName** (`System.String`) - The type name.

## Returns
The IFCData object.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null